[
    {
      "id": "de_vinyles",
      "title": "De Vinyles",
      "description": "Magasin et service fictif de vinyles",
      "type": ["Développement-web"],
      "languages": ["HTML", "CSS"],
      "languages_pourcentage": ["38.8", "61.2"],
      "languages_pourcentage_couleur": ["#1574BC", "#F35C2B"],
      "tags": ["Développement-web", "Front-end", "Figma", "HTML", "CSS"],
      "icone": ["Icones/vinyle.svg"],
      "couverture": ["Images/De_vinyles.png"],
      "images": [
        "Images/De_vinyles_1.png",
        "Images/De_vinyles_2.png",
        "Images/De_vinyles_3.png",
        "Images/De_vinyles_4.png",
        "Images/De_vinyles_5.png"
      ],
      "description_det": [
        "Mon premier projet final dans le cadre scolaire, De Vinyles qui est un site web interactif conçu pour une entreprise fictive de vente de disques vinyles. Le site contient quatre pages principales : une page d'accueil immersive, une boutique interactive, une page 'À propos' et une interface de connexion.",
        "Ce projet met en valeur plusieurs compétences en développement web, notamment l’utilisation avancée de CSS pour intégrer des images, des gifs, des vidéos en arrière-plan et des animations. J'ai également conçu le logo de l'entreprise pour renforcer l'identité visuelle.",
        "L’objectif était de proposer une expérience utilisateur dynamique et visuellement attrayante, tout en gérant efficacement les informations liées au service de vente et de gestion client. Ce projet m'a permis d'explorer des techniques de design web et de développer ma créativité."
      ],
      "Link":["https://www.figma.com/proto/qkA8rlELkQqzCuMI75jVUr/De-Vinyles?node-id=1001-2&p=f&t=Yk6ppiZWalTZTG7K-0&scaling=scale-down&content-scaling=fixed&page-id=0%3A1&starting-point-node-id=1001%3A2"],
      "Code":[""]
    },
    {
      "id": "snakey",
      "title": "Snakey",
      "description": "Jeu de serpent",
      "type": ["Développement-logiciel"],
      "languages": ["HTML", "CSS", "JavaScript"],
      "languages_pourcentage": ["21.2", "11.9", "66.9"],
      "languages_pourcentage_couleur": ["#1574BC", "#F35C2B", "#FBB343"],
      "tags": ["Développement-logiciel", "Front-end", "Back-end", "HTML", "CSS", "JavaScript"],
      "icone": ["Icones/snakey.svg"],
      "couverture": ["Images/Snakey.png"],
      "images": [
        "Images/Snakey_1.png",
        "Images/Snakey_2.png",
        "Images/Snakey_3.png",
        "Images/Snakey_4.png",
        "Images/Snakey_5.png"
      ],
      "description_det": [
        "Snakey est un autre projet final de groupe que j'ai réalisé avec un camarde de classe lors de mon échange universitaire à l'étranger (en Lettonie).",
        "Inspiré du jeu original Snake populaire des années 2000, ce site web est recréation du jeu de serpent qui est majoritairement codé en Javascript. L'objectif de ce projet était de créer un jeu sous forme de logiciel offrant à la fois un visuel attrayant et des bonnes performances de gameplay.",
        "Entièrement animé et interactif, ce projet est en grande partie en back-end afin de s'assurer sur la fluidité du jeu permettant de le faire fonctionner sans aucun bug sur n'importe quel navigateur web. Le site web offre un visuel moderne du jeu original avec une possibilité de changer de thèmes et de pouvoir jouer en mode sombre grâce à des boutons se trouvant en dessous du jeu."
      ],
      "Link":["https://carlos75clc.github.io/DIP392-BCH92/snake.html"],
      "Code":["https://github.com/Carlos75clc/DIP392-BCH92"]
    },
    {
      "id": "asmasse",
      "title": "ASMASSE",
      "description": "Cabinet de massages et bien-être",
      "type": ["Développement-web"],
      "languages": ["HTML", "CSS", "JavaScript"],
      "languages_pourcentage": ["", "", ""],
      "languages_pourcentage_couleur": ["#1574BC", "#F35C2B", "#FBB343"],
      "tags": ["Développement-web", "Front-end", "Back-end", "Figma", "UX-UI", "HTML", "CSS", "JavaScript", "Responsive"],
      "icone": ["Icones/asmasse.svg"],
      "couverture": ["Images/asmasse.png"],
      "images": [
        "Images/asmasse_1.png",
        "Images/asmasse_2.png",
        "Images/asmasse_3.png",
        "Images/asmasse_4.png",
        "Images/asmasse_5.png"
      ],
      "description_det": [
        "Lors de mon stage de développement web d’un mois chez ASMASSE, j'ai participé à la reconstruction complète du site internet de l’entreprise spécialisée dans le bien-être.",
        "Mon travail a été divisé en trois phases principales : la phase de conception du design avec Figma, la phase de développement du site en HTML, CSS et JavaScript, puis la phase de déploiement et de mise en production.",
        "J’ai collaboré avec l’équipe pour définir un design moderne, centré sur l’expérience utilisateur, et j’ai assuré le déploiement du site tout en corrigeant les bugs et en réalisant des tests.",
        "Ce stage m'a permis de renforcer mes compétences en développement web, en design d’interfaces et en gestion de projet, tout en me préparant à des défis professionnels dans le domaine du développement web."
      ],
      "Link":["http://www.asmasse.eu/"],
      "Code":[""]
    },
    {
      "id": "portfolio",
      "title": "Portfolio",
      "description": "Vous êtes actuellement sur le site ;)",
      "type": ["Développement-web"],
      "languages": ["HTML", "CSS", "Javascript"],
      "languages_pourcentage": ["100", "100", "100"],
      "languages_pourcentage_couleur": ["#1574BC", "#F35C2B", "#FBB343"],
      "tags": ["Développement-web", "Front-end", "Back-end", "UX-UI", "HTML", "CSS", "JavaScript", "Responsive"],
      "icone": ["Icones/B.svg"],
      "couverture": ["Images/Portfolio.png"],
      "images": [
        "Images/Portfolio_1.png",
        "Images/Portfolio_2.png",
        "Images/Portfolio_3.png",
        "Images/Portfolio_4.png"
      ],
      "description_det": [
        "Mon portfolio présente mes projets de développement informatique de manière dynamique et optimisée.",
        "Grâce à un fichier JSON, le code JavaScript génère automatiquement les encadré des projets et leurs popups, réduisant le code source et améliorant la performance du site. Cette approche permet de charger les projets efficacement tout en minimisant l’utilisation de mémoire, assurant ainsi une navigation fluide et rapide.",
        "Ce projet regroupe mes compétences que j'ai acquis tout au long de ma formation à l'ESILV et des différents projets et stages, reflétant mon évolution dans le développement informatique.",
        "Mon portfolio est en évolution constante, afin d’éviter tout bug, d’assurer une adaptation correcte des informations JSON et d'améliorer continuellement son efficacité."
      ],
      "Link":[""],
      "Code":["https://github.com/bastosjt/Portfolio"]
    },
    {
        "id": "serveur_c2",
        "title": "Serveur C2 custom",
        "description": "Gestion des systèmes connectés",
        "type": ["Cybersécurité"],
        "languages": ["Python"],
        "languages_pourcentage": ["100"],
        "languages_pourcentage_couleur": ["#1574BC"],
        "tags": ["Cybersécurité", "C2", "Python", "Linux"],
        "icone": ["Icones/python.svg"],
        "couverture": ["Images/C2.png"],
        "images": [
          "Images/C2_1.png",
          "Images/C2_2.png",
          "Images/C2_3.png",
          "Images/C2_4.png"
        ],
        "description_det": [
          "Ce projet de groupe est un serveur C2 (Command & Control) simple et personnalisé développé en Python, permettant la gestion à distance d'un client Windows.",
          "Il utilise un socket TCP pour établir une connexion entre un serveur sur une VM Kali et un client sur un terminal Windows.",
          "Les fonctionnalités incluent l'exécution de commandes système, un keylogger intégré, la prise de captures d'écran et un scanner de ports distant. Le serveur offre une interface interactive permettant de gérer les connexions et d'exécuter différentes tâches sur le client compromis.",
          "Ce projet m'a permis d'explorer la communication réseau en Python et les aspects liés à la cybersécurité offensive."
        ],
        "Link":[""],
        "Code":["https://github.com/Carlos75clc/C2-in-python"]
    },
    {
        "id": "kubernetes",
        "title": "Kubernetes",
        "description": "App web sur un cluster Kubernetes",
        "type": ["DevOps"],
        "languages": ["HTML", "Javascript", "Dockerfile"],
        "languages_pourcentage": ["65.6", "33", "1.4"],
        "languages_pourcentage_couleur": ["#1574BC", "#FBB343", "#2496ED"],
        "tags": ["DevOps", "Kubernetes", "Docker", "NodeJS", "MySQL"],
        "icone": ["Icones/kubernetes.svg"],
        "couverture": ["Images/Kubernetes.png"],
        "images": [
          "Images/Kubernetes_1.png",
          "Images/Kubernetes_2.png",
          "Images/Kubernetes_3.png",
          "Images/Kubernetes_4.png",
          "Images/Kubernetes_5.png"
        ],
        "description_det": [
          "Ce projet consiste en le déploiement d'une application web sur un cluster Kubernetes à l'aide de Minikube.",
          "L'application utilise Node.js pour le backend et MySQL comme base de données. L'ensemble des services est conteneurisé avec Docker, puis orchestré via Kubernetes, garantissant ainsi la scalabilité, la sécurité et la résilience de l'application.",
          "Je vous invite à jeter un œil au code complet sur mon GitHub pour plus de détails sur la configuration, l'architecture et le déploiement de cette application.",
          "Ce projet démontre mes compétences en déploiement cloud et gestion d'infrastructure avec Kubernetes et Docker, en plus de l'intégration de services web et de bases de données."
        ],
        "Link":[""],
        "Code":["https://github.com/bastosjt/Projet-kubernetes"]
    },
    {
      "id": "data_visualisation",
      "title": "Visualisation de datas",
      "description": "Analyse des attaques APT",
      "type": ["Data-visualization"],
      "languages": ["HTML", "CSS", "JavaScript"],
      "languages_pourcentage": ["10.1", "12.7", "77.2"],
      "languages_pourcentage_couleur": ["#1574BC", "#F35C2B", "#FBB343"],
      "tags": ["Data Visualization", "Cybersécurité", "HTML", "CSS", "JavaScript", "D3.js"],
      "icone": ["Icones/DataViz.svg"],
      "couverture": ["Images/DataViz.png"],
      "images": [
        "Images/DataViz_1.png",
        "Images/DataViz_2.png"
      ],
      "description_det": [
        "Ce projet consiste en la création d'un dashboard interactif permettant d'explorer et d'analyser les données des attaques APT en 2023-2024.",
        "Les données sont manipulées et préparées à l'aide de Python avant d'être intégrées et affichées via D3.js sous forme de graphiques interactifs : camemberts, donuts, courbes et cartes.",
        "Le dashboard offre la possibilité de filtrer les attaques selon leur type. Selon le type d'attaque sélectionné, les données affichées s'ajustent automatiquement pour fournir des informations pertinentes sur les différents types de menaces.",
        "Le projet est développé avec HTML, CSS et JavaScript, et la visualisation des données est entièrement gérée par la bibliothèque D3.js, offrant ainsi une expérience utilisateur fluide et interactive.",
        "Ce projet m'a permis de renforcer mes compétences en manipulation des données, en data visualization, et en développement web interactif dans le cadre de la cybersécurité.",
        "Ce projet est en cours de réalisation."
      ],
      "Link": ["https://bastosjt.github.io/Data-Visulation/"],
      "Code": ["https://github.com/bastosjt/Data-Visulation"]
    }
  ]
  
